fireFoam/testBatteryFireFOAM/coFlowFlame2D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//combustionModel    infinitelyFastChemistry;
combustionModel    eddyDissipationModel;

eddyDissipationModelCoeffs
{
    C       4.0;
}

infinitelyFastChemistryCoeffs
{
    C       10.0;
}

noCombustionCoeffs
{
}


// ************************************************************************* //
